NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK70F15.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC2</name>
      <description>Analog-to-Digital Converter</description>
      <groupName>ADC</groupName>
      <prependToName>ADC2_</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC2</name>
        <value>102</value>
      </interrupt>
      <registers>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A,B</dimIndex>
          <name>SC1%s</name>
          <description>ADC status and control registers 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>When DIFF=0, DADP0 is selected as input; when DIFF=1, DAD0 is selected as input.</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>When DIFF=0, DADP1 is selected as input; when DIFF=1, DAD1 is selected as input.</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00010</name>
                  <description>When DIFF=0, DADP2 is selected as input; when DIFF=1, DAD2 is selected as input.</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00011</name>
                  <description>When DIFF=0, DADP3 is selected as input; when DIFF=1, DAD3 is selected as input.</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00100</name>
                  <description>When DIFF=0, AD4 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00101</name>
                  <description>When DIFF=0, AD5 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00110</name>
                  <description>When DIFF=0, AD6 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00111</name>
                  <description>When DIFF=0, AD7 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01000</name>
                  <description>When DIFF=0, AD8 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01001</name>
                  <description>When DIFF=0, AD9 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01010</name>
                  <description>When DIFF=0, AD10 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01011</name>
                  <description>When DIFF=0, AD11 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01100</name>
                  <description>When DIFF=0, AD12 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01101</name>
                  <description>When DIFF=0, AD13 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01110</name>
                  <description>When DIFF=0, AD14 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111</name>
                  <description>When DIFF=0, AD15 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>When DIFF=0, AD16 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>When DIFF=0, AD17 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>When DIFF=0, AD18 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10011</name>
                  <description>When DIFF=0, AD19 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10100</name>
                  <description>When DIFF=0, AD20 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10101</name>
                  <description>When DIFF=0, AD21 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10110</name>
                  <description>When DIFF=0, AD22 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10111</name>
                  <description>When DIFF=0, AD23 is selected as input; when DIFF=1, it is reserved.</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11010</name>
                  <description>When DIFF=0, Temp sensor (single-ended) is selected as input; when DIFF=1, Temp sensor (differential) is selected as input.</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11011</name>
                  <description>When DIFF=0, Bandgap (single-ended) is selected as input; when DIFF=1, Bandgap (differential) is selected as input.</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11101</name>
                  <description>When DIFF=0, VREFSH is selected as input; when DIFF=1, -VREFSH (differential) is selected as input. Voltage reference selected is determined by the REFSEL bits in the SC2 register.</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11110</name>
                  <description>When DIFF=0, VREFSL is selected as input; when DIFF=1, it is reserved. Voltage reference selected is determined by the REFSEL bits in the SC2 register.</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111</name>
                  <description>Module disabled.</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFF</name>
              <description>Differential mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Single-ended conversions and input channels are selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Differential conversions and input channels are selected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Conversion complete interrupt disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Conversion complete interrupt enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COCO</name>
              <description>Conversion complete flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Conversion not completed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Conversion completed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <description>ADC configuration register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADICLK</name>
              <description>Input clock select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Bus clock.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Bus clock divided by 2.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Alternate clock (ALTCLK).</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Asynchronous clock (ADACK).</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Conversion mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>When DIFF=0: It is single-ended 8-bit conversion; when DIFF=1, it is differential 9-bit conversion with 2&apos;s complement output.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>When DIFF=0: It is single-ended 12-bit conversion; when DIFF=1, it is differential 13-bit conversion with 2&apos;s complement output.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>When DIFF=0: It is single-ended 10-bit conversion; when DIFF=1, it is differential 11-bit conversion with 2&apos;s complement output.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>When DIFF=0: It is single-ended 16-bit conversion; when DIFF=1, it is differential 16-bit conversion with 2&apos;s complement output .</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLSMP</name>
              <description>Sample time configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Short sample time.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Long sample time.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIV</name>
              <description>Clock divide select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>The divide ratio is 1 and the clock rate is input clock.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>The divide ratio is 2 and the clock rate is (input clock)/2.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>The divide ratio is 4 and the clock rate is (input clock)/4.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>The divide ratio is 8 and the clock rate is (input clock)/8.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLPC</name>
              <description>Low-power configuration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal power configuration.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Low power configuration. The power is reduced at the expense of maximum clock speed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>Configuration register 2</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADLSTS</name>
              <description>Long sample time select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Default longest sample time (20 extra ADCK cycles; 24 ADCK cycles total).</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>12 extra ADCK cycles; 16 ADCK cycles total sample time.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>6 extra ADCK cycles; 10 ADCK cycles total sample time.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>2 extra ADCK cycles; 6 ADCK cycles total sample time.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADHSC</name>
              <description>High speed configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal conversion sequence selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>High speed conversion sequence selected (2 additional ADCK cycles to total conversion time).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADACKEN</name>
              <description>Asynchronous clock output enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Asynchronous clock output disabled; Asynchronous clock only enabled if selected by ADICLK and a conversion is active.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Asynchronous clock and clock output enabled regardless of the state of the ADC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXSEL</name>
              <description>ADC Mux select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ADxxa channels are selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ADxxb channels are selected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A,B</dimIndex>
          <name>R%s</name>
          <description>ADC data result register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2</dimIndex>
          <name>CV%s</name>
          <description>Compare value registers</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CV</name>
              <description>Compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
