NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK70F15.svd
        <register>
          <name>C6</name>
          <description>MCG Control 6 Register</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VDIV0</name>
              <description>VCO0 Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Multiply Factor is 24</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Multiply Factor is 25</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Multiply Factor is 26</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Multiply Factor is 27</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Multiply Factor is 28</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Multiply Factor is 29</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Multiply Factor is 30</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Multiply Factor is 31</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>Multiply Factor is 32</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>Multiply Factor is 33</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Multiply Factor is 34</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Multiply Factor is 35</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>Multiply Factor is 36</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>Multiply Factor is 37</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>Multiply Factor is 38</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>Multiply Factor is 39</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>Multiply Factor is 40</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>Multiply Factor is 41</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>Multiply Factor is 42</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>Multiply Factor is 43</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>Multiply Factor is 44</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>Multiply Factor is 45</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>Multiply Factor is 46</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>Multiply Factor is 47</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>Multiply Factor is 48</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>Multiply Factor is 49</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>Multiply Factor is 50</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>Multiply Factor is 51</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>Multiply Factor is 52</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>Multiply Factor is 53</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>Multiply Factor is 54</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>Multiply Factor is 55</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CME0</name>
              <description>Clock Monitor Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>External clock monitor is disabled for OSC0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>External clock monitor is enabled for OSC0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLS</name>
              <description>PLL Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FLL is selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PLLCS output clock is selected (PRDIV0 bits of PLL in control need to be programmed to the correct divider to generate a PLL reference clock in the range of 1 - 32 MHz prior to setting the PLLS bit).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOLIE0</name>
              <description>Loss of Lock Interrrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No interrupt request is generated on loss of lock.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generate an interrupt request on loss of lock.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>S</name>
          <description>MCG Status Register</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IRCST</name>
              <description>Internal Reference Clock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Source of internal reference clock is the slow clock (32 kHz IRC).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Source of internal reference clock is the fast clock (2 MHz IRC).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSCINIT0</name>
              <description>OSC Initialization</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKST</name>
              <description>Clock Mode Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Encoding 0 - Output of the FLL is selected (reset default).</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Encoding 1 - Internal reference clock is selected.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Encoding 2 - External reference clock is selected.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Encoding 3 - Output of the PLL is selected.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREFST</name>
              <description>Internal Reference Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Source of FLL reference clock is the external reference clock.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Source of FLL reference clock is the internal reference clock.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLST</name>
              <description>PLL Select Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Source of PLLS clock is FLL clock.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Source of PLLS clock is PLLCS output clock.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK0</name>
              <description>Lock Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PLL is currently unlocked.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PLL is currently locked.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOLS0</name>
              <description>Loss of Lock Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PLL has not lost lock since LOLS 0 was last cleared.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PLL has lost lock since LOLS 0 was last cleared.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SC</name>
          <description>MCG Status and Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LOCS0</name>
              <description>OSC0 Loss of Clock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Loss of OSC0 has not occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Loss of OSC0 has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCRDIV</name>
              <description>Fast Clock Internal Reference Divider</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Divide Factor is 1</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Divide Factor is 2.</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Divide Factor is 4.</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Divide Factor is 8.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Divide Factor is 16</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Divide Factor is 32</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>Divide Factor is 64</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>Divide Factor is 128.</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTPRSRV</name>
              <description>FLL Filter Preserve Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FLL filter and FLL frequency will reset on changes to currect clock mode.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Fll filter and FLL frequency retain their previous values during new clock mode change.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATMF</name>
              <description>Automatic Trim machine Fail Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Automatic Trim Machine completed normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Automatic Trim Machine failed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATMS</name>
              <description>Automatic Trim Machine Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>32 kHz Internal Reference Clock selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>4 MHz Internal Reference Clock selected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATME</name>
              <description>Automatic Trim Machine Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Auto Trim Machine disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Auto Trim Machine enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ATCVH</name>
          <description>MCG Auto Trim Compare Value High Register</description>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ATCVH</name>
              <description>ATM Compare Value High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATCVL</name>
          <description>MCG Auto Trim Compare Value Low Register</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ATCVL</name>
              <description>ATM Compare Value Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
