NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK70F15.svd
        <register>
          <name>HOSTVER</name>
          <description>Host Controller Version</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1201</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVN</name>
              <description>Specification Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>SD host specification version 2.0, supports test event register and ADMA.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VVN</name>
              <description>Vendor Version Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Freescale SDHC version 1.0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>Freescale SDHC version 2.0</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>Freescale SDHC version 2.1</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>Freescale SDHC version 2.2</description>
                  <value>#10010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCDC</name>
      <description>Liquid Crystal Display Controller</description>
      <prependToName>LCDC_</prependToName>
      <baseAddress>0x400B6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD</name>
        <value>97</value>
      </interrupt>
      <registers>
        <register>
          <name>LSSAR</name>
          <description>LCDC screen start address register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSA</name>
              <description>Screen start address of LCD panel</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>LCDC size register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>YMAX</name>
              <description>Screen height</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XMAX</name>
              <description>Screen width divided by 16</description>
              <bitOffset>20</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVPWR</name>
          <description>LCDC virtual page width register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VPW</name>
              <description>Virtual page width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCPR</name>
          <description>LCDC cursor position register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYP</name>
              <description>Cursor Y position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CXP</name>
              <description>Cursor X position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP</name>
              <description>Arithmetic operation control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable arithmetic operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable arithmetic operation</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC</name>
              <description>Cursor control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCWHB</name>
          <description>LCDC cursor width, height, and blink register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10100FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BD</name>
              <description>Blink divisor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH</name>
              <description>Cursor height</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CW</name>
              <description>Cursor width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BK_EN</name>
              <description>Blink enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Blink is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Blink is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCMR</name>
          <description>LCDC color cursor mapping register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUR_COL_B</name>
              <description>Cursor blue field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>No blue</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111111</name>
                  <description>Full blue</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUR_COL_G</name>
              <description>Cursor green field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>No green</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111111</name>
                  <description>Full green</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUR_COL_R</name>
              <description>Cursor red field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>No red</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111111</name>
                  <description>Full red</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
